In [1]:
import pandas as pd

In [2]:
pwed

NameError: name 'pwed' is not defined

In [3]:
pwd

'C:\\Users\\cyril\\Desktop\\python-homework\\pybank'

In [5]:
cd

C:\Users\cyril

In [6]:
cd Desktop

C:\Users\cyril\Desktop

In [7]:
budget_df=pd.read_csv("budget_data.csv")

In [8]:
budget_df

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [9]:
budget_df["Date"].count()

86

In [10]:
Total_Months = budget_df["Date"].count()

In [11]:
Total = budget_df["Profit/Losses"].sum()
Total

38382578

In [12]:
budget_df["Date"]= pd.to_datetime(budget_df["Date"])

In [14]:
budget_df["Month Name"]=pd.DatetimeIndex(budget_df["Date"]).month_name()
budget_df["Year"]=pd.DatetimeIndex(budget_df["Date"]).year
budget_df

         Date  Profit/Losses  month Month Name  Year
0  2010-01-01         867884      1    January  2010
1  2010-02-01         984655      2   February  2010
2  2010-03-01         322013      3      March  2010
3  2010-04-01         -69417      4      April  2010
4  2010-05-01         310503      5        May  2010
..        ...            ...    ...        ...   ...
81 2016-10-01         102685     10    October  2016
82 2016-11-01         795914     11   November  2016
83 2016-12-01          60988     12   December  2016
84 2017-01-01         138230      1    January  2017
85 2017-02-01         671099      2   February  2017

[86 rows x 5 columns]

In [15]:
budget_df.loc[:,budget_df.columns !="month"]

         Date  Profit/Losses Month Name  Year
0  2010-01-01         867884    January  2010
1  2010-02-01         984655   February  2010
2  2010-03-01         322013      March  2010
3  2010-04-01         -69417      April  2010
4  2010-05-01         310503        May  2010
..        ...            ...        ...   ...
81 2016-10-01         102685    October  2016
82 2016-11-01         795914   November  2016
83 2016-12-01          60988   December  2016
84 2017-01-01         138230    January  2017
85 2017-02-01         671099   February  2017

[86 rows x 4 columns]

In [16]:
Average_change =budget_df["Profit/Losses"].diff().mean()
round(Average_change,2)

-2315.12

In [21]:
Greatest_Increase_in_Profits = budget_df["Profit/Losses"].diff().max()
Greatest_Increase_in_Profits

1926159.0

In [23]:
Greatest_Decrease_in_Profits = budget_df["Profit/Losses"].diff().min()
Greatest_Decrease_in_Profits

-2196167.0

In [35]:
budget_df["diff"] = budget_df["Profit/Losses"].diff()
budget_df

         Date  Profit/Losses  month Month Name  Year      diff
0  2010-01-01         867884      1    January  2010       NaN
1  2010-02-01         984655      2   February  2010  116771.0
2  2010-03-01         322013      3      March  2010 -662642.0
3  2010-04-01         -69417      4      April  2010 -391430.0
4  2010-05-01         310503      5        May  2010  379920.0
..        ...            ...    ...        ...   ...       ...
81 2016-10-01         102685     10    October  2016 -665765.0
82 2016-11-01         795914     11   November  2016  693229.0
83 2016-12-01          60988     12   December  2016 -734926.0
84 2017-01-01         138230      1    January  2017   77242.0
85 2017-02-01         671099      2   February  2017  532869.0

[86 rows x 6 columns]

In [54]:
budget_df["Month Name"] = budget_df["Month Name"].str[:3]

In [55]:
budget_df

         Date  Profit/Losses  month Month Name  Year      diff Month
0  2010-01-01         867884      1        Jan  2010       NaN   Jan
1  2010-02-01         984655      2        Feb  2010  116771.0   Feb
2  2010-03-01         322013      3        Mar  2010 -662642.0   Mar
3  2010-04-01         -69417      4        Apr  2010 -391430.0   Apr
4  2010-05-01         310503      5        May  2010  379920.0   May
..        ...            ...    ...        ...   ...       ...   ...
81 2016-10-01         102685     10        Oct  2016 -665765.0   Oct
82 2016-11-01         795914     11        Nov  2016  693229.0   Nov
83 2016-12-01          60988     12        Dec  2016 -734926.0   Dec
84 2017-01-01         138230      1        Jan  2017   77242.0   Jan
85 2017-02-01         671099      2        Feb  2017  532869.0   Feb

[86 rows x 7 columns]

In [62]:
budget_df["diff"].max()

1926159.0

In [65]:
print (f"Financial Analysis")
print (f"----------------------------")
print (f"Total Months: {Total_Months}")
print (f"Total: ${Total}")
print (f"Average Change: ${Average_change}")
print (f"Greatest Increase in Profits: Feb-2012 $({Greatest_Increase_in_Profits})")
print (f"Greatest Decrease in Profits: Sep-2013 $({Greatest_Decrease_in_Profits}")

Financial Analysis
----------------------------
Total Months: 86
Total: $38382578
Average Change: $-2315.1176470588234
Greatest Increase in Profits: Feb-2012 $(1926159.0)
Greatest Decrease in Profits: Seo-2013 $(-2196167.0